In [1]:
import pandas as pd

In [2]:
# url の設定
url = 'https://raw.githubusercontent.com/Haruyama-KobeU/Py4Basics/master/data/data1.csv'

# 読み込み
df = pd.read_csv(url)

In [3]:
df

    year  gdp   inv   con  pop id
0   2000  100  20.0  80.0    8  a
1   2001   95  25.0  70.0    9  b
2   2002   93  21.0  72.0   10  a
3   2003  100  30.0  70.0   11  b
4   2004  110  39.0  71.0   12  a
5   2005  115  55.0  60.0   14  b
6   2006  113  50.0  63.0   15  a
7   2007  118  53.0  65.0   17  b
8   2008  119  60.0  59.0   18  a
9   2009  200  62.0   NaN   20  b
10  2010  210   NaN   NaN   21  a

In [4]:
df = df.set_index('year')
df

      gdp   inv   con  pop id
year
2000  100  20.0  80.0    8  a
2001   95  25.0  70.0    9  b
2002   93  21.0  72.0   10  a
2003  100  30.0  70.0   11  b
2004  110  39.0  71.0   12  a
2005  115  55.0  60.0   14  b
2006  113  50.0  63.0   15  a
2007  118  53.0  65.0   17  b
2008  119  60.0  59.0   18  a
2009  200  62.0   NaN   20  b
2010  210   NaN   NaN   21  a

In [5]:
df.head()

      gdp   inv   con  pop id
year
2000  100  20.0  80.0    8  a
2001   95  25.0  70.0    9  b
2002   93  21.0  72.0   10  a
2003  100  30.0  70.0   11  b
2004  110  39.0  71.0   12  a

In [6]:
df.head(2)

      gdp   inv   con  pop id
year
2000  100  20.0  80.0    8  a
2001   95  25.0  70.0    9  b

In [7]:
df.tail()

      gdp   inv   con  pop id
year
2006  113  50.0  63.0   15  a
2007  118  53.0  65.0   17  b
2008  119  60.0  59.0   18  a
2009  200  62.0   NaN   20  b
2010  210   NaN   NaN   21  a

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11 entries, 2000 to 2010
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   gdp     11 non-null     int64
 1   inv     10 non-null     float64
 2   con     9 non-null      float64
 3   pop     11 non-null     int64
 4   id      11 non-null     object
dtypes: float64(2), int64(2), object(1)
memory usage: 528.0+ bytes

In [9]:
df.describe()

              gdp        inv        con        pop
count   11.000000  10.000000   9.000000  11.000000
mean   124.818182  41.500000  67.777778  14.090909
std     40.715644  16.473885   6.666667   4.482288
min     93.000000  20.000000  59.000000   8.000000
25%    100.000000  26.250000  63.000000  10.500000
50%    113.000000  44.500000  70.000000  14.000000
75%    118.500000  54.500000  71.000000  17.500000
max    210.000000  62.000000  80.000000  21.000000

In [10]:
df.shape

(11, 5)

In [11]:
df.shape[0]

11

In [12]:
len(df)

11

In [13]:
df.to_numpy()

array([[100, 20.0, 80.0, 8, 'a'],
       [95, 25.0, 70.0, 9, 'b'],
       [93, 21.0, 72.0, 10, 'a'],
       [100, 30.0, 70.0, 11, 'b'],
       [110, 39.0, 71.0, 12, 'a'],
       [115, 55.0, 60.0, 14, 'b'],
       [113, 50.0, 63.0, 15, 'a'],
       [118, 53.0, 65.0, 17, 'b'],
       [119, 60.0, 59.0, 18, 'a'],
       [200, 62.0, nan, 20, 'b'],
       [210, nan, nan, 21, 'a']], dtype=object)

In [14]:
type(df.to_numpy())

numpy.ndarray

In [15]:
df.columns

Index(['gdp', 'inv', 'con', 'pop', 'id'], dtype='object')

In [16]:
type(df.columns)

pandas.core.indexes.base.Index

In [17]:
df_columns = df.columns.tolist()
df_columns

['gdp', 'inv', 'con', 'pop', 'id']

In [18]:
df.index

Int64Index([2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010], dtype='int64', name='year')

In [19]:
type(df.index)

pandas.core.indexes.numeric.Int64Index

In [20]:
df_index = df.index.tolist()
df_index

[2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010]

In [21]:
df.loc[2005,:]

gdp     115
inv    55.0
con    60.0
pop      14
id        b
Name: 2005, dtype: object

In [22]:
df.loc[[2005],:]

      gdp   inv   con  pop id
year
2005  115  55.0  60.0   14  b

In [23]:
df.loc[[2005, 2010],:]

      gdp   inv   con  pop id
year
2005  115  55.0  60.0   14  b
2010  210   NaN   NaN   21  a

In [24]:
df.loc[2005:2008,:]

      gdp   inv   con  pop id
year
2005  115  55.0  60.0   14  b
2006  113  50.0  63.0   15  a
2007  118  53.0  65.0   17  b
2008  119  60.0  59.0   18  a

In [25]:
df.loc[:,'gdp']

year
2000    100
2001     95
2002     93
2003    100
2004    110
2005    115
2006    113
2007    118
2008    119
2009    200
2010    210
Name: gdp, dtype: int64

In [26]:
df.loc[:,['gdp','pop']]

      gdp  pop
year
2000  100    8
2001   95    9
2002   93   10
2003  100   11
2004  110   12
2005  115   14
2006  113   15
2007  118   17
2008  119   18
2009  200   20
2010  210   21

In [27]:
df.loc[:,'inv':'pop']

       inv   con  pop
year
2000  20.0  80.0    8
2001  25.0  70.0    9
2002  21.0  72.0   10
2003  30.0  70.0   11
2004  39.0  71.0   12
2005  55.0  60.0   14
2006  50.0  63.0   15
2007  53.0  65.0   17
2008  60.0  59.0   18
2009  62.0   NaN   20
2010   NaN   NaN   21

In [28]:
df.iloc[1,:]

gdp      95
inv    25.0
con    70.0
pop       9
id        b
Name: 2001, dtype: object

In [29]:
df.iloc[[1,4],:]

      gdp   inv   con  pop id
year
2001   95  25.0  70.0    9  b
2004  110  39.0  71.0   12  a

In [30]:
df.iloc[1:4,:]

      gdp   inv   con  pop id
year
2001   95  25.0  70.0    9  b
2002   93  21.0  72.0   10  a
2003  100  30.0  70.0   11  b

In [31]:
df.iloc[:,1]

year
2000    20.0
2001    25.0
2002    21.0
2003    30.0
2004    39.0
2005    55.0
2006    50.0
2007    53.0
2008    60.0
2009    62.0
2010     NaN
Name: inv, dtype: float64

In [32]:
df.iloc[:,[1]]

       inv
year
2000  20.0
2001  25.0
2002  21.0
2003  30.0
2004  39.0
2005  55.0
2006  50.0
2007  53.0
2008  60.0
2009  62.0
2010   NaN

In [33]:
df.iloc[:,[1,3]]

       inv  pop
year
2000  20.0    8
2001  25.0    9
2002  21.0   10
2003  30.0   11
2004  39.0   12
2005  55.0   14
2006  50.0   15
2007  53.0   17
2008  60.0   18
2009  62.0   20
2010   NaN   21

In [34]:
df.iloc[:,1:3]

       inv   con
year
2000  20.0  80.0
2001  25.0  70.0
2002  21.0  72.0
2003  30.0  70.0
2004  39.0  71.0
2005  55.0  60.0
2006  50.0  63.0
2007  53.0  65.0
2008  60.0  59.0
2009  62.0   NaN
2010   NaN   NaN

In [35]:
df['gdp']

year
2000    100
2001     95
2002     93
2003    100
2004    110
2005    115
2006    113
2007    118
2008    119
2009    200
2010    210
Name: gdp, dtype: int64

In [36]:
df[['gdp']]

      gdp
year
2000  100
2001   95
2002   93
2003  100
2004  110
2005  115
2006  113
2007  118
2008  119
2009  200
2010  210

In [37]:
df[['gdp','pop']]

      gdp  pop
year
2000  100    8
2001   95    9
2002   93   10
2003  100   11
2004  110   12
2005  115   14
2006  113   15
2007  118   17
2008  119   18
2009  200   20
2010  210   21

In [38]:
df['gdp'] < 100

year
2000    False
2001     True
2002     True
2003    False
2004    False
2005    False
2006    False
2007    False
2008    False
2009    False
2010    False
Name: gdp, dtype: bool

In [39]:
cond = (df['gdp'] < 100)

In [40]:
df.loc[cond,:]

      gdp   inv   con  pop id
year
2001   95  25.0  70.0    9  b
2002   93  21.0  72.0   10  a

In [41]:
cond = (df.loc[:,'id'] == 'a')
df.loc[cond,:]

      gdp   inv   con  pop id
year
2000  100  20.0  80.0    8  a
2002   93  21.0  72.0   10  a
2004  110  39.0  71.0   12  a
2006  113  50.0  63.0   15  a
2008  119  60.0  59.0   18  a
2010  210   NaN   NaN   21  a

In [42]:
cond1 = (df['gdp'] >= 100)
cond2 = (df['inv'] <= 30)

In [43]:
cond = (cond1 & cond2)

In [44]:
df.loc[cond, :]

      gdp   inv   con  pop id
year
2000  100  20.0  80.0    8  a
2003  100  30.0  70.0   11  b

In [45]:
cond1 = (df['gdp'] >= 200)
cond2 = (df['con'] <= 60)
cond = (cond1 | cond2)

df.loc[cond, :]

      gdp   inv   con  pop id
year
2005  115  55.0  60.0   14  b
2008  119  60.0  59.0   18  a
2009  200  62.0   NaN   20  b
2010  210   NaN   NaN   21  a

In [46]:
cond1 = (df['gdp'] >= 200)
cond2 = (df['con'] <= 60)
cond3 = (df['id'] == 'a')
cond = ((cond1 | cond2) & cond3)

df.loc[cond, :]

      gdp   inv   con  pop id
year
2008  119  60.0  59.0   18  a
2010  210   NaN   NaN   21  a

In [47]:
df.query('gdp < 100')

      gdp   inv   con  pop id
year
2001   95  25.0  70.0    9  b
2002   93  21.0  72.0   10  a

In [48]:
df.query('id == "a"')

      gdp   inv   con  pop id
year
2000  100  20.0  80.0    8  a
2002   93  21.0  72.0   10  a
2004  110  39.0  71.0   12  a
2006  113  50.0  63.0   15  a
2008  119  60.0  59.0   18  a
2010  210   NaN   NaN   21  a

In [49]:
df.query('(gdp >= 100) & (inv <= 30)')

      gdp   inv   con  pop id
year
2000  100  20.0  80.0    8  a
2003  100  30.0  70.0   11  b

In [50]:
df.query('(gdp >= 200) | (con <= 60)')

      gdp   inv   con  pop id
year
2005  115  55.0  60.0   14  b
2008  119  60.0  59.0   18  a
2009  200  62.0   NaN   20  b
2010  210   NaN   NaN   21  a

In [51]:
df.query('(gdp >= 200 | con <= 60) & (id == "a")')

      gdp   inv   con  pop id
year
2008  119  60.0  59.0   18  a
2010  210   NaN   NaN   21  a

In [52]:
from myst_nb import glue
z = 100
glue0 = df.query('gdp < @z')
glue("glue0_txt", glue0)

      gdp   inv   con  pop id
year
2001   95  25.0  70.0    9  b
2002   93  21.0  72.0   10  a

In [53]:
df['Intercept'] = 1.0

In [54]:
df.head(2)

      gdp   inv   con  pop id  Intercept
year
2000  100  20.0  80.0    8  a        1.0
2001   95  25.0  70.0    9  b        1.0

In [55]:
gdp_pc = df['gdp']/df['pop']
gdp_pc.head()

year
2000    12.500000
2001    10.555556
2002     9.300000
2003     9.090909
2004     9.166667
dtype: float64

In [56]:
df['gdp_pc'] = gdp_pc

In [57]:
df.head(2)

      gdp   inv   con  pop id  Intercept     gdp_pc
year
2000  100  20.0  80.0    8  a        1.0  12.500000
2001   95  25.0  70.0    9  b        1.0  10.555556

In [58]:
df.loc[:,'2pop'] = 2*df['pop']

In [59]:
del df['2pop']

In [60]:
df = df.drop(['Intercept','gdp_pc'], axis='columns')

# df.drop('Intercept', axis='columns', inplace=True)

In [61]:
df.loc[2011,:] = [215, 100, 115, 22, 'b']

In [62]:
df.tail(3)

        gdp    inv    con   pop id
year
2009  200.0   62.0    NaN  20.0  b
2010  210.0    NaN    NaN  21.0  a
2011  215.0  100.0  115.0  22.0  b

In [63]:
df = df.drop(2011, axis='rows')

# df.drop(2011, axis=0, inplace=True)

In [64]:
df.isna().sum(axis='rows')

gdp    0
inv    1
con    2
pop    0
id     0
dtype: int64

In [65]:
df.isna().sum(axis='columns')

year
2000    0
2001    0
2002    0
2003    0
2004    0
2005    0
2006    0
2007    0
2008    0
2009    1
2010    2
dtype: int64

In [66]:
filter = df.isna().any(axis='columns')
df.loc[filter,:]

        gdp   inv  con   pop id
year
2009  200.0  62.0  NaN  20.0  b
2010  210.0   NaN  NaN  21.0  a

In [67]:
df.dropna()

        gdp   inv   con   pop id
year
2000  100.0  20.0  80.0   8.0  a
2001   95.0  25.0  70.0   9.0  b
2002   93.0  21.0  72.0  10.0  a
2003  100.0  30.0  70.0  11.0  b
2004  110.0  39.0  71.0  12.0  a
2005  115.0  55.0  60.0  14.0  b
2006  113.0  50.0  63.0  15.0  a
2007  118.0  53.0  65.0  17.0  b
2008  119.0  60.0  59.0  18.0  a

In [68]:
df.dropna(subset=['inv'])

        gdp   inv   con   pop id
year
2000  100.0  20.0  80.0   8.0  a
2001   95.0  25.0  70.0   9.0  b
2002   93.0  21.0  72.0  10.0  a
2003  100.0  30.0  70.0  11.0  b
2004  110.0  39.0  71.0  12.0  a
2005  115.0  55.0  60.0  14.0  b
2006  113.0  50.0  63.0  15.0  a
2007  118.0  53.0  65.0  17.0  b
2008  119.0  60.0  59.0  18.0  a
2009  200.0  62.0   NaN  20.0  b

In [69]:
df.sort_values('gdp').head()

        gdp   inv   con   pop id
year
2002   93.0  21.0  72.0  10.0  a
2001   95.0  25.0  70.0   9.0  b
2000  100.0  20.0  80.0   8.0  a
2003  100.0  30.0  70.0  11.0  b
2004  110.0  39.0  71.0  12.0  a

In [70]:
df.sort_values('gdp', ascending=False).head()

        gdp   inv   con   pop id
year
2010  210.0   NaN   NaN  21.0  a
2009  200.0  62.0   NaN  20.0  b
2008  119.0  60.0  59.0  18.0  a
2007  118.0  53.0  65.0  17.0  b
2005  115.0  55.0  60.0  14.0  b

In [71]:
df.sort_values(['id','gdp'], ascending=['True','False']).head()

        gdp   inv   con   pop id
year
2002   93.0  21.0  72.0  10.0  a
2000  100.0  20.0  80.0   8.0  a
2004  110.0  39.0  71.0  12.0  a
2006  113.0  50.0  63.0  15.0  a
2008  119.0  60.0  59.0  18.0  a

In [72]:
df.reset_index()

    year    gdp   inv   con   pop id
0   2000  100.0  20.0  80.0   8.0  a
1   2001   95.0  25.0  70.0   9.0  b
2   2002   93.0  21.0  72.0  10.0  a
3   2003  100.0  30.0  70.0  11.0  b
4   2004  110.0  39.0  71.0  12.0  a
5   2005  115.0  55.0  60.0  14.0  b
6   2006  113.0  50.0  63.0  15.0  a
7   2007  118.0  53.0  65.0  17.0  b
8   2008  119.0  60.0  59.0  18.0  a
9   2009  200.0  62.0   NaN  20.0  b
10  2010  210.0   NaN   NaN  21.0  a

In [73]:
df.reset_index(drop=True).head()

     gdp   inv   con   pop id
0  100.0  20.0  80.0   8.0  a
1   95.0  25.0  70.0   9.0  b
2   93.0  21.0  72.0  10.0  a
3  100.0  30.0  70.0  11.0  b
4  110.0  39.0  71.0  12.0  a

In [74]:
df.rename(columns={'pop':'pop_new','id':'id_new'}).head()

        gdp   inv   con  pop_new id_new
year
2000  100.0  20.0  80.0      8.0      a
2001   95.0  25.0  70.0      9.0      b
2002   93.0  21.0  72.0     10.0      a
2003  100.0  30.0  70.0     11.0      b
2004  110.0  39.0  71.0     12.0      a

In [75]:
s = df.loc[:,'gdp']
s

year
2000    100.0
2001     95.0
2002     93.0
2003    100.0
2004    110.0
2005    115.0
2006    113.0
2007    118.0
2008    119.0
2009    200.0
2010    210.0
Name: gdp, dtype: float64

In [76]:
s.to_numpy()

array([100.,  95.,  93., 100., 110., 115., 113., 118., 119., 200., 210.])

In [77]:
type(s.to_numpy())

numpy.ndarray

In [78]:
s.name

'gdp'

In [79]:
s.index

Int64Index([2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010], dtype='int64', name='year')

In [80]:
s.index.name

'year'

In [81]:
s_new = s.copy()
s_new.index = [i for i in 'abcdefghijk']
s_new

a    100.0
b     95.0
c     93.0
d    100.0
e    110.0
f    115.0
g    113.0
h    118.0
i    119.0
j    200.0
k    210.0
Name: gdp, dtype: float64

In [82]:
s_new[5]

115.0

In [83]:
s_new[[1,3,5]]

b     95.0
d    100.0
f    115.0
Name: gdp, dtype: float64

In [84]:
s_new[5:-2]

f    115.0
g    113.0
h    118.0
i    119.0
Name: gdp, dtype: float64

In [85]:
s_new['b']

95.0

In [86]:
s_new[['b','e','j']]

b     95.0
e    110.0
j    200.0
Name: gdp, dtype: float64